[Rainmeter]
Update=1000
Group=PRTSkin | PRTSkinDoctor

OnRefreshAction=[!Zpos -2]

DefaultDraggable=0
DefaultKeepOnScreen=0
DefaultSnapEdges=0

ContextTitle=调整位置/缩放
ContextTitle2=完成调整位置/缩放
ContextAction=[!Draggable "1"][!SetOption DoctorEdit Hidden "0"][!UpdateMeterGroup Doctor]
ContextAction2=[!Draggable "0"][!SetOption DoctorEdit Hidden "1"][!WriteKeyValue Variables DoctorImageScale #DoctorImageScale# "#@#Settings.ini"][!UpdateMeterGroup Doctor]

[Metadata]
Name=Rhodes_Island_UI
Author=热心炎国云玩家
Information=让您在PC上也能享受到罗德岛终端系统的交互界面。|显示您背影的画像。
License=Closure Commons 署名-不许获利-传递下去 42.0
Version=0.10.0

[Variables]
@Include1=#@#GlobalVars.inc


[Doctor]
Meter=Image
Group=Doctor
ImageName=#DoctorImage#
H=(#DoctorImageScale#*480)
AntiAlias=1
DynamicVariables=1

[DoctorEdit]
Meter=Image
MeterStyle=Doctor
ImageAlpha=0
Hidden=1
MouseScrollUpAction=[!SetVariable DoctorImageScale "(Clamp(#DoctorImageScale#+0.05,0.25,3))"][!UpdateMeterGroup Doctor][!Redraw]
MouseScrollDownAction=[!SetVariable DoctorImageScale "(Clamp(#DoctorImageScale#-0.05,0.25,3))"][!UpdateMeterGroup Doctor][!Redraw]